A4/RT2_long/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.1)
    (1 0 -0.1)
    (1 4 -0.1)
    (0 4 -0.1)
    
    (0 0 0.1)
    (1 0 0.1)
    (1 4 0.1)
    (0 4 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 400 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topwall
    {
        type wall;
        // type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    leftWall
    {
        type symmetryPlane;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type symmetryPlane;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
